evidence/week4_cloud/20260703T002438Z_wrk_real_gateway_admission/wrk_output.txt
Running 30s test @ http://127.0.0.1:18082
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.29ms    6.15ms  79.03ms   86.96%
    Req/Sec     0.96k    69.63     2.22k    79.24%
  Latency Distribution
     50%   25.27ms
     75%   28.10ms
     90%   31.43ms
     99%   56.64ms
  229481 requests in 30.09s, 54.93MB read
Requests/sec:   7627.65
Transfer/sec:      1.83MB

===== wrk admission summary =====
requests=229481
duration_us=30085427
errors.connect=0
errors.read=0
errors.write=0
errors.status=0
latency_p50_us=25272
latency_p95_us=34122